# GetDirectShapeLibrary Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DirectShapeLibrary..::..GetDirectShapeLibrary Method
DirectShapeLibrary Class See Also
---
Get the currently active Library object
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public static DirectShapeLibrary GetDirectShapeLibrary(
	Document ADoc
)
```

Visual Basic
---
```text
Public Shared Function GetDirectShapeLibrary ( _
	ADoc As Document _
) As DirectShapeLibrary
```

Visual C++
---
```text
public:
static DirectShapeLibrary^ GetDirectShapeLibrary(
	Document^ ADoc
)
```

# ### Parameters
ADoc
    Type: Autodesk.Revit.DB..::..Document
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
DirectShapeLibrary Class
Autodesk.Revit.DB Namespace